SCHEMA_REDIS = {
    "Реестр проектов": {
        "given_repr_route": {"Список проектов", "Количество завершенных задач", "Общее количество задач"},
        "given_repr_user": {"Календарь топ", "Оповещения"},
        "change_repr": {}
    },
    "Реестр задач проекта": {
        "given_repr_route": {"Список задач", "Количество завершенных поручений", "Общее количество поручений"},
        "given_repr_user": {"Календарь топ", "Оповещения"},
        "change_repr": {}
    },
    "Проект": {
        "given_repr_route": {"Информацию по проекту", "Список задач","История проекта", "История задач", "История поручений"},
        "given_repr_user": {"Календарь топ", "Оповещения"},
        "change_repr": {"Список проектов", "История проекта"}
    },
    "Задача": {
        "given_repr_route": {"Информацию по задаче", "Информация о поручениях", "Чаты", "Файлы", "История задачи", "История поручений"},
        "given_repr_user": {"Календарь топ", "Оповещения"},
        "change_repr": {
            "Количество завершенных задач", "Общее количество задач", "Список задач", "Количество завершенных поручений", 
            "Общее количество поручений", "История задач", "История поручений", "Календарь топ", "Календарь"
        }
    }


    
}